{"class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "conv2d_41", "class_name": "Conv2D", "config": {"name": "conv2d_41", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_49", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_49", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_41", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_49", 0, 0, {}]]]}, {"name": "batch_normalization_41", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAcywAAAB0AGoBdABqAnwAZABkAIUCGQB0AGoBfABkAWQCjQIY\nAIMBZAZkBGQFjQNTACkHTukAAAAAKQHaBGF4aXPpAQAAAFQpAnICAAAA2ghrZWVwZGltc+n/////\nKQPaAUvaBG1lYW7aA2FicykB2gF4qQByCgAAAPofPGlweXRob24taW5wdXQtMTEtYmYxYTIyMTM5\nNTM1PtoIPGxhbWJkYT5ZAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}], ["lambda_16", 0, 0, {}]]]}, {"name": "conv2d_42", "class_name": "Conv2D", "config": {"name": "conv2d_42", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "leaky_re_lu_50", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_50", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_42", 0, 0, {}]]]}, {"name": "dropout_22", "class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_50", 0, 0, {}]]]}, {"name": "batch_normalization_42", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_42", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAcywAAAB0AGoBdABqAnwAZABkAIUCGQB0AGoBfABkAWQCjQIY\nAIMBZAZkBGQFjQNTACkHTukAAAAAKQHaBGF4aXPpAQAAAFQpAnICAAAA2ghrZWVwZGltc+n/////\nKQPaAUvaBG1lYW7aA2FicykB2gF4qQByCgAAAPofPGlweXRob24taW5wdXQtMTEtYmYxYTIyMTM5\nNTM1PtoIPGxhbWJkYT5gAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}], ["lambda_17", 0, 0, {}]]]}, {"name": "conv2d_43", "class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "leaky_re_lu_51", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_51", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_43", 0, 0, {}]]]}, {"name": "dropout_23", "class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_51", 0, 0, {}]]]}, {"name": "batch_normalization_43", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_43", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAcywAAAB0AGoBdABqAnwAZABkAIUCGQB0AGoBfABkAWQCjQIY\nAIMBZAZkBGQFjQNTACkHTukAAAAAKQHaBGF4aXPpAQAAAFQpAnICAAAA2ghrZWVwZGltc+n/////\nKQPaAUvaBG1lYW7aA2FicykB2gF4qQByCgAAAPofPGlweXRob24taW5wdXQtMTEtYmYxYTIyMTM5\nNTM1PtoIPGxhbWJkYT5nAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_43", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_43", 0, 0, {}], ["lambda_18", 0, 0, {}]]]}, {"name": "conv2d_44", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_52", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_52", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"name": "dropout_24", "class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_52", 0, 0, {}]]]}, {"name": "flatten_11", "class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_11", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_11", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["dense_11", 0, 0], ["dense_12", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}