{"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "flatten_12", "class_name": "Flatten", "config": {"name": "flatten_12", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true}, "inbound_nodes": [[["input_27", 0, 0, {}], ["flatten_12", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "target_shape": [1, 1, 128]}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "conv2d_transpose_11", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_11", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["reshape_6", 0, 0, {}]]]}, {"name": "batch_normalization_44", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_44", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_53", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_53", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_44", 0, 0, {}]]]}, {"name": "conv2d_transpose_12", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_12", "trainable": true, "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_53", 0, 0, {}]]]}, {"name": "batch_normalization_45", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_45", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_54", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_54", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_45", 0, 0, {}]]]}, {"name": "up_sampling2d_16", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_16", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_54", 0, 0, {}]]]}, {"name": "conv2d_45", "class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_16", 0, 0, {}]]]}, {"name": "batch_normalization_46", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_46", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"name": "leaky_re_lu_55", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_55", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["batch_normalization_46", 0, 0, {}]]]}, {"name": "up_sampling2d_17", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_17", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_55", 0, 0, {}]]]}, {"name": "conv2d_46", "class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_17", 0, 0, {}]]]}, {"name": "batch_normalization_47", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_47", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}, {"name": "leaky_re_lu_56", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_56", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["batch_normalization_47", 0, 0, {}]]]}, {"name": "up_sampling2d_18", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_18", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_56", 0, 0, {}]]]}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_48", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_48", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"name": "leaky_re_lu_57", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_57", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["batch_normalization_48", 0, 0, {}]]]}, {"name": "conv2d_48", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_57", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}], "input_layers": [["input_27", 0, 0], ["input_28", 0, 0]], "output_layers": [["activation_6", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}